tutorials/10steadyBBEnclosed/ITHACAoutput/supremizer/0/Tlift1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tlift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
0.00499995
0.0149999
0.0249998
0.0349997
0.0449997
0.0549997
0.0649997
0.0749998
...
)
;

boundaryField
{
    Adiabatic_walls
    {
        type            zeroGradient;
    }
    Left
    {
        type            fixedValue;
        value           uniform 0;
    }
    Right
    {
        type            fixedValue;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
